// Напишите программу, которая на вход принимает число и выдает его квадрат
Console.Write("Enter a number: ");
int number = Convert.ToInt32(Console.ReadLine());
Console.Write("Result: ");
Console.WriteLine(number * number);

